src/main/resources/uml/14-레이어드-아키텍쳐-02.puml
@startuml
package "Presentation Layer" {
    class OrderController
}
package "Application Layer" {
    class OrderService
    class Order
}
package "Infrastructure Layer" {
    interface OrderRepository
    class OrderJpaRepository
}

OrderController .r.> OrderService
OrderService .r.> Order
OrderService ..> OrderRepository
OrderRepository .l.> Order
OrderRepository <|.. OrderJpaRepository
@enduml
